bench/rheotool/cylinder_wi1.0_R10_shrunk15R/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          12;
        startFace       6579;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          116;
        startFace       6591;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          62;
        startFace       6707;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       6769;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6684;
        startFace       6789;
    }
)

// ************************************************************************* //
