bench/rheotool/cylinder_wi1.0_R10_shrunk15R/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (-15 0 0)
  (-2.83 0 0)
  (-1 0 0)
  (-0.7071067812 0.7071067812 0)
  (-0.3826834324 0.9238795325 0)
  (0 1 0)
  (0.3826834324 0.9238795325 0)
  (0.7071067812 0.7071067812 0)
  (1 0 0)
  (2.83 0 0)
  (15 0 0)
  (15 2 0)
  (2 2 0)
  (0.83 2 0)
  (0 2 0)
  (-0.83 2 0)
  (-2 2 0)
  (-15 2 0) //End 17

  (-15 0 1)
  (-2.83 0 1)
  (-1 0 1)
  (-0.7071067812 0.7071067812 1)
  (-0.3826834324 0.9238795325 1)
  (0 1 1)
  (0.3826834324 0.9238795325 1)
  (0.7071067812 0.7071067812 1)
  (1 0 1)
  (2.83 0 1)
  (15 0 1)
  (15 2 1)
  (2 2 1)
  (0.83 2 1)
  (0 2 1)
  (-0.83 2 1)
  (-2 2 1)
  (-15 2 1)
  
  

);

blocks
(
    hex (0 1 16 17 18 19 34 35) (23 6 1) simpleGrading (0.12 1 1) //0  (R10 variant: y 40->6 to match block 1 angular; shrunk L_up=15R 23 cells)
    hex (2 3 16 1 20 21 34 19) (6 43 1) simpleGrading (1 30 1) //1   (R10 variant: angular 40->6, target ~30 per 180deg)
    hex (3 4 15 16 21 22 33 34) (4 43 1) simpleGrading (0.5 30 1) //2  (R10 variant: angular 23->4)
    hex (4 5 14 15 22 23 32 33) (4 43 1) simpleGrading (1 30 1) //3   (R10 variant: angular 23->4)
    hex (5 6 13 14 23 24 31 32) (4 43 1) simpleGrading (1 30 1) //4   (R10 variant: angular 23->4)
    hex (6 7 12 13 24 25 30 31) (3 43 1) simpleGrading (2 30 1) //5   (R10 variant: angular 20->3)
    hex (7 8 9 12 25 26 27 30) (10 43 1) simpleGrading (0.2 30 1) //6 (R10 variant: angular 60->10)
    hex (9 10 11 12 27 28 29 30) (20 10 1) simpleGrading (8 5 1) //7  (R10 variant: y 60->10 to match block 6 angular; shrunk L_down=15R 20 cells)
   

);

edges
(
  arc 5 6 (0.195090322 0.9807852804 0)
  arc 6 7 (0.555570233 0.8314696123 0)
  arc 7 8 (0.9238795325 0.3826834324 0)
  arc 12 9 (2.614579077 1.0829941136 0)

  arc 4 5 (-0.195090322 0.9807852804 0)
  arc 3 4 (-0.555570233 0.8314696123 0)
  arc 2 3 (-0.9238795325 0.3826834324 0)
  arc 1 16 (-2.614579077 1.0829941136 0)

  arc 23 24(0.195090322 0.9807852804 1)
  arc 24 25 (0.555570233 0.8314696123 1)
  arc 25 26 (0.9238795325 0.3826834324 1)
  arc 30 27 (2.614579077 1.0829941136 1)

  arc 22 23 (-0.195090322 0.9807852804 1)
  arc 21 22 (-0.555570233 0.8314696123 1)
  arc 20 21 (-0.9238795325 0.3826834324 1)
  arc 19 34 (-2.614579077 1.0829941136 1)

);

boundary
(

    inlet
    {
      type patch;
      faces
      (
            (0 17 35 18)
            
        );
    }
    walls
    {
        type wall;
        faces
        (
            (17 16 34 35)
            
            (16 15 33 34)
            
            (15 14 32 33)
            (14 13 31 32)
            (13 12 30 31)
            (12 11 29 30)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
           
            (2 3 21 20)
            (3 4 22 21)
            (4 5 23 22)
            (5 6 24 23)
            (6 7 25 24)
            (7 8 26 25) 
            
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 11 29 28)
            
            
        );
    }    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 16 17)
            (1 2 3 16)
            (3 4 15 16)
            (4 5 14 15)
            (5 6 13 14)
            (6 7 12 13)
            (7 8 9 12)
            (9 10 11 12)
            
            (18 19 34 35)
            (19 20 21 34)
            (21 22 33 34)
            (22 23 32 33)
            (23 24 31 32)
            (24 25 30 31)
            (25 26 27 30)
            (27 28 29 30)
        );
    }     
);

mergePatchPairs
(
);

// ************************************************************************* //
